Revit 2024 API
ParameterTypeId.StairsAttrStairCalculator Property
 "Calculation Rules"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsAttrStairCalculator { get; }
Visual Basic
Public Shared ReadOnly Property StairsAttrStairCalculator As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsAttrStairCalculator {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace